SM_для_EDT/src/Catalogs/vftДокладыОНесоответствии/vftДокладыОНесоответствии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>vftДокладыОНесоответствии</name>
  <predefined>
    <items>
      <name>рарусВременныйДоклад</name>
    </items>
  </predefined>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.vftСтатусыДокументовСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОКапитана</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветКомпании</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОИнспектора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнспектирующийОрган</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоИнспекции</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИнспекции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокУстранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоклада</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияДоклада</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SM_для_EDT/src/Enums/vftСтатусыДокументовСообщений/vftСтатусыДокументовСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>vftСтатусыДокументовСообщений</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Инициировано</name>
  </enumValues>
  <enumValues>
    <name>Проведено</name>
  </enumValues>
  <enumValues>
    <name>ОтправленНаСудно</name>
  </enumValues>
  <enumValues>
    <name>ОтправленНаДоработку</name>
  </enumValues>
  <enumValues>
    <name>Доработан</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Catalogs/vftНесоответствия/vftНесоответствия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>vftНесоответствия</name>
  <owners>Catalog.vftДокладыОНесоответствии</owners>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.vftСтатусыДокументовСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеНесоответствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНесоответствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректирующиеДействия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНесоответствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаДокумент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйКомментарийНесоответствие</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяРешениеКомпании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписаниеНесоответствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеКорректирующийхДействий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредписанныеСрокиУстранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемыеСрокиУстранения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьОтветственныйРешение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИООтветственныйРешение</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействияПринятыеДляУстранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстранения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйКомментарийДонесение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДонесенияОбУстранении</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДонесения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуютсяПредупреждающиеДействия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МерыПоПредотвращениюПовторенияНесоответствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредписанныеСрокиПредупреждающихДействий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемыеСрокиВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьОтветственныйПредупреждающиеДействия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИООтветственныйПредупреждающиеДействия</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗамечания</name>
    <type>
      <types>EnumRef.рарусТипыЗамечания</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаПредупреждающиеДействия</name>
    <type>
      <types>CatalogRef.рарусЗоныОтветственности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодУстраненияЗамечания</name>
    <type>
      <types>CatalogRef.рарусКлассификаторыКодовУстраненияЗамечаний</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЗамечаний</name>
    <type>
      <types>CatalogRef.рарусКлассификаторыКодовЗамечаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ПовторяющеесяЗамечания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПКДОтправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПКД</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредупреждающиеДействия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗамечаниеЗакрыто</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиоОтветственногоЗаЗакрытиеЗамечания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецЗамечания</name>
    <type>
      <types>CatalogRef.vftДокладыОНесоответствии</types>
      <types>DocumentRef.рарусМероприятиеСУБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьСоздания</name>
    <type>
      <types>EnumRef.рарусОбластиРедактирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВопросАнкетирования</name>
    <comment>rarus zalikh</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеССайтаOCIMF</name>
    <comment>zalikh</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетОВыполненииПКДОтправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиОтчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиоОтветственногоЗаОтметкуОВыполнении</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтветственныеПодразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.vftПодразделенияКомпании</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтветственныеПодразделенияЗаПредупреждающиеДействия</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.vftПодразделенияКомпании</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗоныОтветственности</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗанаОтветственности</name>
      <type>
        <types>CatalogRef.рарусЗоныОтветственности</types>
      </type>
    </attributes>
    <attributes>
      <name>КорректирующиеДействия</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемыеСрокиУстранения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностьОтветственного</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИООтветственного</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыПоЗамечанию</name>
    <attributes>
      <name>ДокументОтражающийДефект</name>
      <type>
        <types>DocumentRef.впЗаявкаНаСнабжение</types>
        <types>DocumentRef.впВыявленныеДефекты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SM_для_EDT/src/Catalogs/vftДокладыОНесоответствии/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
	
Процедура ПриКопировании(ОбъектКопирования)
	
	vftОбщиеПроцедурыДокументовСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
	Код = "";
	Дата = ТекущаяДата();
	
КонецПроцедуры
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
		Если ОбменДанными.Загрузка  Тогда
			
			Возврат;
			
		КонецЕсли; 
		
		//Установим новый номер
		Если Код = "" Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЕСТЬNULL(МАКСИМУМ(vftДокладыОНесоответствии.НомерДоклада), 0) КАК НомерДоклада
			|ИЗ
			|	Справочник.vftДокладыОНесоответствии КАК vftДокладыОНесоответствии
			|ГДЕ
			|	vftДокладыОНесоответствии.Судно = &Судно
			|	И НАЧАЛОПЕРИОДА(vftДокладыОНесоответствии.Дата, ГОД) = НАЧАЛОПЕРИОДА(&Дата, ГОД)";
			
			Запрос.УстановитьПараметр("Дата", Дата);
			Запрос.УстановитьПараметр("Судно", Судно);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				НомерДоклада = Выборка.НомерДоклада + 1;
			КонецЕсли; 
			
			Код = Строка(НомерДоклада) + "/" + Формат(дата,"ДФ=yy");
			
		КонецЕсли; 
		
		// ++ ilshill 15.01.2021 
		
		// Проверки перенесены в обработчик
		
		//МассивРеквизитовДляОбязательногоЗаполнения = Новый Массив;
		//
		//Если Статус <> Перечисления.vftСтатусыДокументовСообщений.Черновик Тогда
		//	
		//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ФИОКапитана");
		//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ФИОИнспектора");
		//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ИнспектирующийОрган");
		//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("МестоИнспекции");
		//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ДатаИнспекции");
		//			
		//КонецЕсли; 
		
		//Отказ = НЕ ПроверитьЗаполнение();
		//
		//vftОбщиеПроцедурыДокументовСервер.ПроверитьЗаполнениеРеквизитов(ЭтотОбъект,МассивРеквизитовДляОбязательногоЗаполнения,Отказ);
		//
		//Если Статус <> Перечисления.vftСтатусыДокументовСообщений.Черновик Тогда
		//	
		//	//Проверим что есть несоответствия и их статус <= статусу документа
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = 
		//	"ВЫБРАТЬ
		//	|	ВЫБОР
		//	|		КОГДА vftНесоответствия.Статус = ЗНАЧЕНИЕ(Перечисление.vftСтатусыДокументовСообщений.Черновик)
		//	|			ТОГДА 0
		//	|		КОГДА vftНесоответствия.Статус = ЗНАЧЕНИЕ(Перечисление.vftСтатусыДокументовСообщений.Отправлен)
		//	|			ТОГДА 1
		//	|		КОГДА vftНесоответствия.Статус = ЗНАЧЕНИЕ(Перечисление.vftСтатусыДокументовСообщений.Получен)
		//	|			ТОГДА 2
		//	|		КОГДА vftНесоответствия.Статус = ЗНАЧЕНИЕ(Перечисление.vftСтатусыДокументовСообщений.Закрыт)
		//	|			ТОГДА 3
		//	|	КОНЕЦ КАК СтатусНесоответствия,
		//	|	vftНесоответствия.Ссылка
		//	|ИЗ
		//	|	Справочник.vftНесоответствия КАК vftНесоответствия
		//	|ГДЕ
		//	|	vftНесоответствия.ПометкаУдаления = ЛОЖЬ
		//	|	И vftНесоответствия.Владелец = &Владелец";
		//	
		//	Если ЭтотОбъект.Статус = Перечисления.vftСтатусыДокументовСообщений.Черновик Тогда
		//		СтатусДокумента = 0;
		//	ИначеЕсли ЭтотОбъект.Статус = Перечисления.vftСтатусыДокументовСообщений.Отправлен Тогда
		//		СтатусДокумента = 1;
		//	ИначеЕсли ЭтотОбъект.Статус = Перечисления.vftСтатусыДокументовСообщений.Получен Тогда
		//		СтатусДокумента = 2;
		//	Иначе
		//		СтатусДокумента = 3;
		//	КонецЕсли;
		//	//		"ВЫБРАТЬ
		//	//|	ВЫБОР
		//	//|		КОГДА vftНесоответствия.Статус = ЗНАЧЕНИЕ(Перечисление.vftСтатусыДокументовСообщений.Черновик)
		//	//|			ТОГДА 0
		//	//|		КОГДА vftНесоответствия.Статус = ЗНАЧЕНИЕ(Перечисление.vftСтатусыДокументовСообщений.Отправлен)
		//	//|			ТОГДА 1
		//	//|		КОГДА vftНесоответствия.Статус = ЗНАЧЕНИЕ(Перечисление.vftСтатусыДокументовСообщений.Получен)
		//	//|			ТОГДА 2
		//	//|		КОГДА vftНесоответствия.Статус = ЗНАЧЕНИЕ(Перечисление.vftСтатусыДокументовСообщений.Закрыт)
		//	//|			ТОГДА 3
		//	//|	КОНЕЦ КАК СтатусНесоответствия,
		//	//|	ВЫБОР
		//	//|		КОГДА vftНесоответствия.Владелец.Статус = ЗНАЧЕНИЕ(Перечисление.vftСтатусыДокументовСообщений.Черновик)
		//	//|			ТОГДА 0
		//	//|		КОГДА vftНесоответствия.Владелец.Статус = ЗНАЧЕНИЕ(Перечисление.vftСтатусыДокументовСообщений.Отправлен)
		//	//|			ТОГДА 1
		//	//|		КОГДА vftНесоответствия.Владелец.Статус = ЗНАЧЕНИЕ(Перечисление.vftСтатусыДокументовСообщений.Получен)
		//	//|			ТОГДА 2
		//	//|		КОГДА vftНесоответствия.Владелец.Статус = ЗНАЧЕНИЕ(Перечисление.vftСтатусыДокументовСообщений.Закрыт)
		//	//|			ТОГДА 3
		//	//|	КОНЕЦ КАК СтатусДоклада,
		//	//|	vftНесоответствия.Ссылка
		//	//|ИЗ
		//	//|	Справочник.vftНесоответствия КАК vftНесоответствия
		//	//|ГДЕ
		//	//|	vftНесоответствия.ПометкаУдаления = ЛОЖЬ
		//	//|	И vftНесоответствия.Владелец = &Владелец";
		
		//	Запрос.УстановитьПараметр("Владелец", Ссылка);
		//	
		//	Выборка =  Запрос.Выполнить().Выбрать();
		//	
		//	Если Выборка.Количество() = 0  Тогда
		//		Сообщение = Новый СообщениеПользователю;
		//		Сообщение.Текст = "В докладе отсутствуют несоответствия.";
		//		//Сообщение.Поле = "СписокНесоответствий";
		//		//Сообщение.ПутьКДанным = "СписокНесоответствий";   		
		//		Сообщение.Сообщить(); 
		//		Отказ = Истина;
		//	КонецЕсли; 
		//	
		//	Пока Выборка.Следующий() Цикл
		//		
		//		Если СтатусДокумента > Выборка.СтатусНесоответствия Тогда
		//			
		//			Сообщение = Новый СообщениеПользователю;
		//			Сообщение.Текст = "Статус несоответствия " + Строка(Выборка.Ссылка) + "ниже статуса доклада.Документ не будет записан.";
		//			//Сообщение.Поле = "СписокНесоответствий";
		//			//Сообщение.ПутьКДанным = "СписокНесоответствий";
		//			Сообщение.Сообщить(); 
		//			Отказ = Истина;
		//			
		//		КонецЕсли; 
		//		
		//	КонецЦикла; 
		//	
		//	
		//КонецЕсли;
		// -- ilshill 15.01.2021 
		
	КонецПроцедуры
	
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
		
		Префикс =  Судно.КодБыстрогоВвода;
		
КонецПроцедуры
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
			
	Если ПолучитьФункциональнуюОпцию("рарусИспользоватьФункционалСУБ") Тогда
		рарусСУБСервер.ОбработкаЗаполнениеДокументовСУБ(ЭтотОбъект);			
	КонецЕсли;
		
КонецПроцедуры
	
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
		МассивНепроверяемыхРеквизитов = Новый Массив;
				
		ИспользоватьФункционалСУБ = ПолучитьФункциональнуюОпцию("рарусИспользоватьФункционалСУБ");
				
		Если ИспользоватьФункционалСУБ Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("ФИОКапитана");
			МассивНепроверяемыхРеквизитов.Добавить("ФИОИнспектора");
			МассивНепроверяемыхРеквизитов.Добавить("ИнспектирующийОрган");
			МассивНепроверяемыхРеквизитов.Добавить("МестоИнспекции");
			МассивНепроверяемыхРеквизитов.Добавить("ДатаИнспекции");
			
		Иначе
			
			Если Статус = Перечисления.vftСтатусыДокументовСообщений.Черновик Тогда
				
				МассивНепроверяемыхРеквизитов.Добавить("ФИОКапитана");
				МассивНепроверяемыхРеквизитов.Добавить("ФИОИнспектора");
				МассивНепроверяемыхРеквизитов.Добавить("ИнспектирующийОрган");
				МассивНепроверяемыхРеквизитов.Добавить("МестоИнспекции");
				МассивНепроверяемыхРеквизитов.Добавить("ДатаИнспекции");
				
			КонецЕсли;
			
		КонецЕсли;
				
			Если Статус <> Перечисления.vftСтатусыДокументовСообщений.Черновик Тогда
				
				Запрос = Новый Запрос;
				ТекстЗапроса = 
				"ВЫБРАТЬ
				|	ВЫБОР
				|		КОГДА vftНесоответствия.Статус = ЗНАЧЕНИЕ(Перечисление.vftСтатусыДокументовСообщений.Черновик)
				|			ТОГДА 0
				|		КОГДА vftНесоответствия.Статус = ЗНАЧЕНИЕ(Перечисление.vftСтатусыДокументовСообщений.Отправлен)
				|			ТОГДА 1
				|		КОГДА vftНесоответствия.Статус = ЗНАЧЕНИЕ(Перечисление.vftСтатусыДокументовСообщений.Получен)
				|			ТОГДА 2
				|		КОГДА vftНесоответствия.Статус = ЗНАЧЕНИЕ(Перечисление.vftСтатусыДокументовСообщений.Закрыт)
				|			ТОГДА 3
				|	КОНЕЦ КАК СтатусНесоответствия,
				|	vftНесоответствия.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.vftНесоответствия КАК vftНесоответствия
				|ГДЕ
				|	vftНесоответствия.ПометкаУдаления = ЛОЖЬ
				|	И (vftНесоответствия.Владелец = &ВладелецЗамечания
				|			ИЛИ vftНесоответствия.ВладелецЗамечания = &ВладелецЗамечания)";
							
				//|	И &УсловиеЗапроса = &ВладелецЗамечания";
				
				//Если ИспользоватьФункционалСУБ Тогда
				//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса , "&УсловиеЗапроса", "vftНесоответствия.ВладелецЗамечания");
				//Иначе
				//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса , "&УсловиеЗапроса", "vftНесоответствия.Владелец");				
				//КонецЕсли;
				
				Запрос.Текст =  ТекстЗапроса;
				
				Запрос.УстановитьПараметр("ВладелецЗамечания", Ссылка);
				
				Если ЭтотОбъект.Статус = Перечисления.vftСтатусыДокументовСообщений.Черновик Тогда
					СтатусДокумента = 0;
				ИначеЕсли ЭтотОбъект.Статус = Перечисления.vftСтатусыДокументовСообщений.Отправлен Тогда
					СтатусДокумента = 1;
				ИначеЕсли ЭтотОбъект.Статус = Перечисления.vftСтатусыДокументовСообщений.Получен Тогда
					СтатусДокумента = 2;
				Иначе
					СтатусДокумента = 3;
				КонецЕсли;
				
				РезультатЗапроса = Запрос.Выполнить();
				
				Если Не РезультатЗапроса.Пустой() Тогда
					
					Выборка = РезультатЗапроса.Выбрать();
					
					//Если Не ИспользоватьФункционалСУБ Тогда
											
						Пока Выборка.Следующий() Цикл
							
							Если СтатусДокумента > Выборка.СтатусНесоответствия Тогда
								
								ТекстОшибки = НСтр("ru = 'Статус несоответствия %НомерСтроки% ниже статуса доклада.Документ не будет записан'");
								ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", Выборка.Ссылка);
								
								ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
								ТекстОшибки,
								ЭтотОбъект
								,
								,
								,Отказ);
								
							КонецЕсли;
							
						КонецЦикла;
						
					//КонецЕсли;
					
				Иначе
					
					ТекстОшибки = НСтр("ru = 'В докладе отсутствуют несоответствия.'");
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект,,, Отказ);
					
				КонецЕсли;
				
			КонецЕсли;
				
		
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);	
		
	КонецПроцедуры
	
#КонецОбласти
	
#КонецЕсли
